<!DOCTYPE html>
<html lang="ru">
<head>
<?php $website_title = 'Информация';
require 'blocks/head.php'; ?>
</head>
<body>
<?php require 'blocks/header.php'; ?>
  <main class="container mt-5">
    <div class="row">
      <div class="col-md-8 mb-3 " >
<p>В настоящее время скорость роста в нашем мире количества Web- ресурсов увеличивается.
Создание веб-приложения «Фотогалерея» позволит регистрироваться,  загружать и просматривать
фотографии, также оставлять комментарии и ставить лайки или дизлайки к постам в любое время и в любом месте.
</p>
<p>Перечень условных обозначений, единиц и терминов использованных для создания Веб-приложения "Фотогалерея" :<br>
<b>HTML</b> - (HyperText Markup Language). Стандартизированный язык разметки документов во Всемирной паутине. <br>
<b>CSS</b> (Cascading Style Sheets) - формальный язык описания внешнего вида документа, написанный с использованием языка разметки.<br>
<b>Bootstrap</b> (также известен как Twitter Bootstrap) — свободный набор инструментов для создания сайтов и веб-приложений. Включает в себя HTML- и CSS-шаблоны оформления для типографики, веб-форм, кнопок, меток, блоков навигации и прочих компонентов веб-интерфейса, включая JavaScript-расширения.<br>
<b>SQL</b> (структурированный язык запросов) - стандартный непроцедурный язык, который ориентирован на обработку данных.<br>
<b>PHP</b> - скриптовый язык общего назначения, интенсивно применяется для разработки веб-приложений.<br>
<b>JavaScript</b>-прототипно-ориентированный сценарный язык программирования. Является реализацией языка ECMAScript.<br>
<b>AJAX</b> (аббревиатура от «Asynchronous Javascript And Xml») – технология обращения к серверу без перезагрузки страницы. За счёт этого уменьшается время отклика и веб-приложение по интерактивности больше напоминает десктоп.<br>
<b>MySQL</b> - свободная реляционная система управления базами данных API - application programming interface. Интерфейс программирования приложений (иногда интерфейс прикладного программирования). HTTP - HyperText Transfer Protocol (протокол передачи гипертекста). Протокол прикладного уровня передачи данных в первую очередь в виде текстовых сообщений.<br>
<b>Open Server Panel</b> — это портативная серверная платформа и программная среда, созданная специально для веб-разработчиков с учётом их рекомендаций и пожеланий.<br>
<b>phpMyAdmin</b> — веб-приложение с открытым кодом, написанное на языке PHP и представляющее собой веб-интерфейс для администрирования СУБД MySQL. PHPMyAdmin позволяет через браузер и не только осуществлять администрирование сервера MySQL, запускать команды SQL и просматривать содержимое таблиц и баз данных.
</p>
      </div>
<?php require 'blocks/aside.php';?>
      </div>
    </main>
    <footer class="footer bg-light">
      <div class="container ">
        <div class="row">
          <div class="col-md-6">
            <span class="text-muted ">Витебск, 2020 год</span>
          </div>
          <div class="col-md-6 img">
            <a href="https://vk.com/"><img class="mr-2" src="img/vk.png"  width="45px" height="45px" alt=""></a>
            <a href="https://www.instagram.com/"><img class="mr-2" src="img/inst.png" width="45px" height="45px"  alt="">
            <a href="https://www.facebook.com/"><img class="mr-2" src="img/fb.png" width="45px" height="45px"  alt="">
          </div>

        </div>
      </div>
    </footer>


</body>
</html>
